csteele-PD/ESP32-C6_Matter_LAB_dimmer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Matter-over-Thread lab identity/providers.
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_FTD=y
CONFIG_OPENTHREAD_RX_ON_WHEN_IDLE=y
CONFIG_OPENTHREAD_RADIO_NATIVE=y
CONFIG_ESP_MATTER_ENABLE_OPENTHREAD=y
CONFIG_ENABLE_MATTER_OVER_THREAD=y
CONFIG_CHIP_DEVICE_ENABLE_THREAD_MESHCOP=y
CONFIG_THREAD_NETWORK_COMMISSIONING_DRIVER=y
# CONFIG_WIFI_NETWORK_COMMISSIONING_DRIVER is not set
# CONFIG_ENABLE_WIFI_STATION is not set

# Thread commissioning needs BLE rendezvous so the controller can deliver
# Thread credentials before the device joins the mesh.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_ENABLE_CHIPOBLE=y
CONFIG_CHIPOBLE_SINGLE_CONNECTION=y
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=y
CONFIG_BLE_DEVICE_NAME_PREFIX="C6LAB-"

# Keep memory behavior visible on the no-PSRAM C6.
CONFIG_CHIP_TASK_STACK_SIZE=12288
CONFIG_ENABLE_THREAD_TELEMETRY=y

# Thread operational discovery should use OpenThread SRP/DNS-SD instead of
# CHIP minimal mDNS, whose default address policy skips wpan interfaces.
# CONFIG_USE_MINIMAL_MDNS is not set

# Use ESP Matter example credentials/providers for lab commissioning.
# CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER is not set
# CONFIG_ENABLE_ESP32_DEVICE_INSTANCE_INFO_PROVIDER is not set
CONFIG_EXAMPLE_DAC_PROVIDER=y
CONFIG_EXAMPLE_COMMISSIONABLE_DATA_PROVIDER=y
# CONFIG_EXAMPLE_DEVICE_INSTANCE_INFO_PROVIDER is not set
CONFIG_CUSTOM_DEVICE_INSTANCE_INFO_PROVIDER=y

CONFIG_DEVICE_VENDOR_ID=0xFFF1
CONFIG_DEVICE_PRODUCT_ID=0x8004
CONFIG_ENABLE_COMMISSIONABLE_DEVICE_TYPE=y
CONFIG_DEVICE_TYPE=257

CONFIG_ENABLE_TEST_SETUP_PARAMS=y
CONFIG_CHIP_ENABLE_PAIRING_AUTOSTART=y

# Keep the first lab firmware small and quiet.
# CONFIG_ENABLE_OTA_REQUESTOR is not set
# CONFIG_ENABLE_CHIP_SHELL is not set
# CONFIG_ENABLE_SNTP_TIME_SYNC is not set
